import { SimpleTranslationEntries } from "#app/plugins/i18n";

export const tutorial: SimpleTranslationEntries = {
    "intro": `Καλωσήρθες στο PokéRogue!\nΕίναι ένα παιχνίδι μάχης Pokémon, με στοιχεία roguelite, φτιαγμένο από φίλους της σειράς. 
    $Αυτό το παιχνίδι δεν δημιουργεί έσοδα και δεν διεκδικούμε την ιδιοκτησία της ετικέτας Pokémon\nούτε των προστατευόμενων απο πνευματικά δικαιώματα περιουσιακών στοιχείων που χρησιμοποιούνται.
    $Το παιχνίδι είναι ακόμα υπό ανάπτυξη, αλλά μπορεί να παιχθεί πλήρως.\nΓια αναφορά προβλημάτων, παρακαλούμε χρησιμοποιήστε την κοινότητα στο Discord.
    $Αν το παιχνίδι τρέχει αργά, βεβαιωθείτε ότι η 'Επιτάχυνση Υλικού' είναι ενεργοποιημένη στις ρυθμίσεις του προγράμματος περιήγησής σας.`,
    
    "accessMenu": `Για πρόσβαση στο μενού, πατήστε M ή Escape.\nΤο μενού περιέχει τις ρυθμίσεις και άλλες διάφορες λειτουργίες.`,
    
    "menu": `Από αυτό το μενού έχετε πρόσβαση στις ρυθμίσεις.
    $Από τις ρυθμίσεις μπορείτε να αλλάξετε την ταχύτητα παιχνιδιού, το στυλ παραθύρου και άλλες επιλογές.
    $Υπάρχουν επίσης διάφορα άλλα χαρακτηριστικά εδώ, οπότε φροντίστε να τα ελέγξετε όλα!`,

    "starterSelect": `Από αυτή την οθόνη, μπορείς να επιλέξεις τα αρχικά σου.\nΑυτά θα είναι τα πρώτα μέλη της ομάδας σου.
    $Κάθε αρχικό έχει μια τιμή.\nΗ ομάδα σου μπορεί να έχει μέχρι και 6 μέλη,
    $φτάνει το άθροισμα των τιμών να μη ξεπερνάει το 10!
    $Μπορείς επίσης να επιλέξεις φύλο, ικανότητα, και μορφή βάση\nτων παραλλαγών που έχεις πιάσει ή εκκολάψει.
    $Επίσης, οι τιμές των IVs του κάθε είδους είναι οι καλύτερες\nγια κάθε ένα από αυτά που έχεις πιάσει ή εκκολάψει,
    $οπότε προσπαθήσε να αποκτήσεις πολλά από κάθε είδος!`,

    "pokerus": `Καθημερινά, τυχαία 3 επιλέξιμα αρχικά έχουν μωβ περίγραμμα.
    $Αν δεις ενα αρχικό που σου ανήκει να έχει μωβ περίγραμμα,\nδοκίμασε να το βάλεις στην ομάδα σου. Φρόντισε να ελέγξεις τη σύνοψή του!`,

    "statChange": `Οι αλλαγές στα στατιστικά παραμένουν σε όλες τις μάχες\nόσο δεν γίνεται ανάκληση των Pokémon σου.
    $Τα Pokémon σου ανακαλούνται πριν από μάχες με εκπαιδευτές και πριν εισέλθεις σε ένα νέο οικοσύστημα.
    $Μπορείς επίσης να δείς τις αλλαγές στατιστικών για τα Pokémon σου την ώρα της μάχης κρατώντας πατημένο το C ή το Shift.`,

    "selectItem": `Μετά από κάθε μάχη, σου δίνεται η επιλογή 3 τυχαίων αντικειμένων. Μπορείς να επιλέξεις μόνο ένα.
    $Αυτά κυμαίνονται από αναλώσιμα, μέχρι αντικείμενα Pokémon, έως μόνιμα αντικείμενα με παθητικές ικανότητες.
    $Οι περισσότερες επιδράσεις των μη αναλώσιμων αντικειμένων\nστοιβάζονται.
    $Ορισμένα αντικείμενα, όπως τα αντικείμενα εξέλιξης,\nθα εμφανίζονται μόνο εάν μπορούν να χρησιμοποιηθούν.
    $Μπορείς επίσης να μεταφέρεις αντικείμενα μεταξύ Pokémon\nχρησιμοποιώντας την επιλογή μεταφοράς.
    $Η επιλογή μεταφοράς θα εμφανιστεί κάτω δεξιά μόλις\nαποκτήσετε ένα αντικείμενο που μπορεί να κρατηθεί.
    $Μπορείς να αγοράσεις αναλώσιμα είδη με χρήματα, 
    $και μεγαλύτερη ποικιλία θα είναι διαθέσιμη όσο περισσότερο προχωράς στο παιχνίδι.
    $Φρόντισε να τα αγοράσεις πριν επιλέξεις το τυχαίο αντικείμενο σου,
    $καθώς το παιχνίδι θα προχωρήσει στην επόμενη μάχη μόλις το κάνεις.`,

    "eggGacha": `Από αυτή την οθόνη, μπορείς να ανταλλάξεις\nτα κουπόνια σου για αυγά Pokémon.
    $Τα αυγά πρέπει να εκκολαφθούν και πλησιάζουν στην\nεκκόλαψη μετά από κάθε μάχη. 
    $Όσο πιο σπάνιο το αυγό, τόσο περισσότερο χρόνο χρειάζεται\nγια να εκκολαφθεί.
    $Τα Pokémon που εκκολαφθούν από αυγά δεν προστίθενται\nστην ομάδα σου,
    $αλλά στα πιθανά αρχικά σου σε επόμενους γύρους.
    $Τα Pokémon που εκκολαφθούν από αυγά έχουν συνήθως\nκαλύτερα IVs από τα άγρια Pokémon.
    $Κάποια Pokémon μπορεί να αποκτηθούν μόνο από αυγά.
    $Υπάρχουν 3 διαφορετικοί κουλοχέρηδες με διαφορετικά\nμπόνους,
    $οπότε επέλεξε αυτόν που σου ταιριάζει περισσότερο!`,
} as const;